0.1.0/tutorials/incompressible/ico/cavity_grade/system/blockMeshDict
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}

convertToMeters 0.1;

vertices
(
  (0 0 0)
  (0.5 0 0)
  (1 0 0)
  (0 0.5 0)
  (0.5 0.5 0)
  (1 0.5 0)
  (0 1 0)
  (0.5 1 0)
  (1 1 0)
  (0 0 0.1)
  (0.5 0 0.1)
  (1 0 0.1)
  (0 0.5 0.1)
  (0.5 0.5 0.1)
  (1 0.5 0.1)
  (0 1 0.1)
  (0.5 1 0.1)
  (1 1 0.1)
);

blocks
(
  hex (0 1 4 3 9 10 13 12) (10 10 1) simpleGrading (2 2 1)
  hex (1 2 5 4 10 11 14 13) (10 10 1) simpleGrading (0.5 2 1)
  hex (3 4 7 6 12 13 16 15) (10 10 1) simpleGrading (2 0.5 1)
  hex (4 5 8 7 13 14 17 16) (10 10 1) simpleGrading (0.5 0.5 1)
);

edges
(
);

boundary
(
  movingWall
  {
    type wall;
    faces
    (
      (6 15 16 7)
      (7 16 17 8)
    );
  }
  fixedWalls
  {
    type wall;
    faces
    (
      (3 12 15 6)
      (0 9 12 3)
      (0 1 10 9)
      (1 2 11 10)
      (2 5 14 11)
      (5 8 17 14)
    );
  }
  frontAndBack
  {
    type empty;
    faces
    (
      (0 3 4 1)
      (1 4 5 2)
      (3 6 7 4)
      (4 7 8 5)
      (9 10 13 12)
      (10 11 14 13)
      (12 13 16 15)
      (13 14 17 16)
    );
  }
);

mergePatchPairs
(
);

// vim: set ft=foam et sw=2 ts=2 sts=2:
